RT-Thread/rt-thread/bsp/freescale/platform/devices/MK24F25612/include/MK24F25612.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define FTF_IRQn                     FTFA_IRQn
#define ADC_BASES                    ADC_BASE_PTRS
#define AIPS_BASES                   AIPS_BASE_PTRS
#define CMP_BASES                    CMP_BASE_PTRS
#define CMT_BASES                    CMT_BASE_PTRS
#define CRC_BASES                    CRC_BASE_PTRS
#define DAC_BASES                    DAC_BASE_PTRS
#define DMA_EARS_REG(base)           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_SHIFT      This_symbol_has_been_deprecated
#define DMA_BASES                    DMA_BASE_PTRS
#define DMA_EARS                     This_symbol_has_been_deprecated
#define DMAMUX_BASES                 DMAMUX_BASE_PTRS
#define EWM_BASES                    EWM_BASE_PTRS
#define FMC_BASES                    FMC_BASE_PTRS
#define FTFA_BASES                   FTFA_BASE_PTRS
#define FTM_BASES                    FTM_BASE_PTRS
#define GPIO_BASES                   GPIO_BASE_PTRS
#define I2C_BASES                    I2C_BASE_PTRS
#define I2S_BASES                    I2S_BASE_PTRS
#define LLWU_BASES                   LLWU_BASE_PTRS
#define LPTMR_BASES                  LPTMR_BASE_PTRS
#define MCG_BASES                    MCG_BASE_PTRS
#define MCM_ISR_REG(base)            MCM_ISCR_REG(base)
#define MCM_ISR_FIOC_MASK            MCM_ISCR_FIOC_MASK
#define MCM_ISR_FIOC_SHIFT           MCM_ISCR_FIOC_SHIFT
#define MCM_ISR_FDZC_MASK            MCM_ISCR_FDZC_MASK
#define MCM_ISR_FDZC_SHIFT           MCM_ISCR_FDZC_SHIFT
#define MCM_ISR_FOFC_MASK            MCM_ISCR_FOFC_MASK
#define MCM_ISR_FOFC_SHIFT           MCM_ISCR_FOFC_SHIFT
#define MCM_ISR_FUFC_MASK            MCM_ISCR_FUFC_MASK
#define MCM_ISR_FUFC_SHIFT           MCM_ISCR_FUFC_SHIFT
#define MCM_ISR_FIXC_MASK            MCM_ISCR_FIXC_MASK
#define MCM_ISR_FIXC_SHIFT           MCM_ISCR_FIXC_SHIFT
#define MCM_ISR_FIDC_MASK            MCM_ISCR_FIDC_MASK
#define MCM_ISR_FIDC_SHIFT           MCM_ISCR_FIDC_SHIFT
#define MCM_ISR_FIOCE_MASK           MCM_ISCR_FIOCE_MASK
#define MCM_ISR_FIOCE_SHIFT          MCM_ISCR_FIOCE_SHIFT
#define MCM_ISR_FDZCE_MASK           MCM_ISCR_FDZCE_MASK
#define MCM_ISR_FDZCE_SHIFT          MCM_ISCR_FDZCE_SHIFT
#define MCM_ISR_FOFCE_MASK           MCM_ISCR_FOFCE_MASK
#define MCM_ISR_FOFCE_SHIFT          MCM_ISCR_FOFCE_SHIFT
#define MCM_ISR_FUFCE_MASK           MCM_ISCR_FUFCE_MASK
#define MCM_ISR_FUFCE_SHIFT          MCM_ISCR_FUFCE_SHIFT
#define MCM_ISR_FIXCE_MASK           MCM_ISCR_FIXCE_MASK
#define MCM_ISR_FIXCE_SHIFT          MCM_ISCR_FIXCE_SHIFT
#define MCM_ISR_FIDCE_MASK           MCM_ISCR_FIDCE_MASK
#define MCM_ISR_FIDCE_SHIFT          MCM_ISCR_FIDCE_SHIFT
#define MCM_BASES                    MCM_BASE_PTRS
#define NV_BASES                     NV_BASE_PTRS
#define OSC_BASES                    OSC_BASE_PTRS
#define PDB_BASES                    PDB_BASE_PTRS
#define PIT_BASES                    PIT_BASE_PTRS
#define PMC_BASES                    PMC_BASE_PTRS
#define PORT_BASES                   PORT_BASE_PTRS
#define RCM_BASES                    RCM_BASE_PTRS
#define RFSYS_BASES                  RFSYS_BASE_PTRS
#define RFVBAT_BASES                 RFVBAT_BASE_PTRS
#define RNG_BASES                    RNG_BASE_PTRS
#define RTC_BASES                    RTC_BASE_PTRS
#define SIM_BASES                    SIM_BASE_PTRS
#define SMC_BASES                    SMC_BASE_PTRS
#define SPI_BASES                    SPI_BASE_PTRS
#define UART_WP7816_T_TYPE0_REG(base) UART_WP7816T0_REG(base)
#define UART_WP7816_T_TYPE1_REG(base) UART_WP7816T1_REG(base)
#define UART_WP7816_T_TYPE0_WI_MASK  UART_WP7816T0_WI_MASK
#define UART_WP7816_T_TYPE0_WI_SHIFT UART_WP7816T0_WI_SHIFT
#define UART_WP7816_T_TYPE0_WI(x)    UART_WP7816T0_WI(x)
#define UART_WP7816_T_TYPE1_BWI_MASK UART_WP7816T1_BWI_MASK
#define UART_WP7816_T_TYPE1_BWI_SHIFT UART_WP7816T1_BWI_SHIFT
#define UART_WP7816_T_TYPE1_BWI(x)   UART_WP7816T1_BWI(x)
#define UART_WP7816_T_TYPE1_CWI_MASK UART_WP7816T1_CWI_MASK
#define UART_WP7816_T_TYPE1_CWI_SHIFT UART_WP7816T1_CWI_SHIFT
#define UART_WP7816_T_TYPE1_CWI(x)   UART_WP7816T1_CWI(x)
#define UART_BASES                   UART_BASE_PTRS
#define USB_BASES                    USB_BASE_PTRS
#define USBDCD_BASES                 USBDCD_BASE_PTRS
#define VREF_BASES                   VREF_BASE_PTRS
#define WDOG_BASES                   WDOG_BASE_PTRS
#define Watchdog_IRQn                WDOG_EWM_IRQn
#define Watchdog_IRQHandler          WDOG_EWM_IRQHandler
#define LPTimer_IRQn                 LPTMR0_IRQn
#define LPTimer_IRQHandler           LPTMR0_IRQHandler
#define LLW_IRQn                     LLWU_IRQn
#define LLW_IRQHandler               LLWU_IRQHandler

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MK24F25612_H_) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MK24F25612_H_) */

/* MK24F25612.h, eof. */
